# NumericRevisionSettings Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumericRevisionSettings Class
Members See Also
---
Contains settings that apply to Revisions with the Numeric RevisionNumberType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class NumericRevisionSettings : IDisposable
```

Visual Basic
---
```text
Public Class NumericRevisionSettings _
	Implements IDisposable
```

Visual C++
---
```text
public ref class NumericRevisionSettings : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..NumericRevisionSettings
# See Also
NumericRevisionSettings Members
Autodesk.Revit.DB Namespace